{
    "hourly": {
        "00:00": "📊 It's midnight! Time to review your trading strategy for tomorrow.",
        "01:00": "💤 Markets are quiet now. Rest well to trade better tomorrow!",
        "02:00": "📉 Asian markets are active. Keep an eye on emerging trends.",
        "03:00": "📋 Use this time to update your trading journal.",
        "04:00": "📚 Improve your trading skills with our educational resources.",
        "05:00": "🌅 Early bird gets the worm! Prepare for the European market opening.",
        "06:00": "⏰ European markets will open soon. Get ready for new opportunities!",
        "07:00": "🚀 European session has started. Watch for initial momentum.",
        "08:00": "📊 Check out our latest trading signals for the European session.",
        "09:00": "💼 Peak trading time in Europe. Stay focused and stick to your strategy.",
        "10:00": "💹 US pre-market activity is starting. Get ready for potential volatility.",
        "11:00": "🔄 Overlapping session between Europe and US pre-market. Great opportunities!",
        "12:00": "🕛 Noon check-in: Have you stuck to your trading plan today?",
        "13:00": "🇺🇸 US markets opening soon. Prepare for increased volatility.",
        "14:00": "📈 US session in full swing. Our analysts are monitoring key levels.",
        "15:00": "🔍 Mid-US session - this is often when key reversals happen.",
        "16:00": "📝 Time to evaluate your open positions and adjust your stops.",
        "17:00": "🌎 European markets closing. Review your day trades.",
        "18:00": "📊 Check our premium channel for after-hours analysis.",
        "19:00": "🔚 US markets approaching close. Secure your profits and manage risk.",
        "20:00": "📑 Time to review your trading performance for the day.",
        "21:00": "🌠 Asian markets opening soon. New opportunities on the horizon!",
        "22:00": "🔮 Looking ahead: Check our forecasts for tomorrow's trading session.",
        "23:00": "📋 End of day summary: See our analysts' take on today's market moves."
    },
    "daily": {
        "Monday": "🚀 Welcome to a new trading week! Check our weekly outlook in the premium channel.",
        "Tuesday": "💼 Tuesday trading tip: Consistency beats intensity. Stick to your strategy!",
        "Wednesday": "📊 Mid-week market update: See how our predictions are playing out.",
        "Thursday": "📈 Economic calendar highlight: Check major announcements coming tomorrow.",
        "Friday": "🎯 Friday focus: Remember to close positions before the weekend if that's your strategy.",
        "Saturday": "📚 Weekend learning: Check our educational resources to improve your skills.",
        "Sunday": "🔮 Sunday market preview: Get ready for the week ahead with our analysis."
    },
    "weekly": {
        "Week 1": "🌟 First week of the month: Major economic indicators are releasing soon.",
        "Week 2": "💹 Second week outlook: Mid-month momentum is building.",
        "Week 3": "📝 Options expiration approaching: Be aware of potential volatility.",
        "Week 4": "🔄 Month-end flows may affect market movements this week.",
        "Week 5": "📊 Rare fifth week of the month: Check our special analysis."
    }
}